#include <iostream>

using namespace std;

//const int n1 = 6;
//int m[n1][n1] =
//{
//{0, 0, 0, 0, 1, 0},
//{0, 0, 1, 0,0,1},
//{0, 1, 0, 0,1,0},
//{0, 0, 0, 0,1,0},
//{1, 0, 1, 1,0,1},
//{0, 1, 0, 0,1,0},
//};

const int n1 = 5;
int m[n1][n1] =
{
{0, 1, 0, 0, 1},
{1, 0, 1, 1, 0},
{0, 1, 0, 0, 1},
{0, 1, 0, 0, 1},
{1, 0, 1, 1, 0},
};

void GL(int v, bool visit[])
{
    cout << v+1 << " "; //вывод одной из вершин, v
    visit[v] = true; //если посещали вершину v

    for (int i = 0; i < n1; i++)
    { //если есть связь между вершинами графа(m[v][i]=1) и 
    //если не посещали вершину(!visit[i]), то обращение к рекурсивной     функции
        
            if (m[v][i] == 1 && !visit[i])
            {
                GL(i, visit);
            }
    }
}


void main()
{
    setlocale(LC_ALL, "RUS");

    
    cout << "     "; for (int i = 0; i < n1; i++) { cout << i+1 << " "; }; cout << endl<<endl;
    for (int i = 0; i < n1; i++)
    {
        cout << i+1 << ".   ";
        for (int j = 0; j < n1; j++)
        {
            cout << m[i][j] << " ";
        }
        cout << endl;
    }

    int start;
    cout << endl <<"Введите с какой точки начать обход: ";
    cin >> start;

    bool visit[n1];
    for (int i = 0; i < n1; i++) { visit[i] = false; }

    cout << "Обход в глубину: ";
    GL(start-1, visit);
}

//////////// Тесты для 1 графа 

//1 2 3 4 5 6
//
//1.   0 0 0 0 1 0
//2.   0 0 1 0 0 1
//3.   0 1 0 0 1 0
//4.   0 0 0 0 1 0
//5.   1 0 1 1 0 1
//6.   0 1 0 0 1 0
//
//Введите с какой точки начать обход : 1
//Обход в глубину : 1 5 3 2 6 4

//1 2 3 4 5 6
//
//1.   0 0 0 0 1 0
//2.   0 0 1 0 0 1
//3.   0 1 0 0 1 0
//4.   0 0 0 0 1 0
//5.   1 0 1 1 0 1
//6.   0 1 0 0 1 0
//
//Введите с какой точки начать обход : 2
//Обход в глубину : 2 3 5 1 4 6

//1 2 3 4 5 6
//
//1.   0 0 0 0 1 0
//2.   0 0 1 0 0 1
//3.   0 1 0 0 1 0
//4.   0 0 0 0 1 0
//5.   1 0 1 1 0 1
//6.   0 1 0 0 1 0
//
//Введите с какой точки начать обход : 6
//Обход в глубину : 6 2 3 5 1 4

//////////// Тесты для 2 графа 

//1 2 3 4 5
//
//1.   0 1 0 0 1
//2.   1 0 1 1 0
//3.   0 1 0 0 1
//4.   0 1 0 0 1
//5.   1 0 1 1 0
//
//Введите с какой точки начать обход : 3
//Обход в глубину : 3 2 1 5 4

//1 2 3 4 5
//
//1.   0 1 0 0 1
//2.   1 0 1 1 0
//3.   0 1 0 0 1
//4.   0 1 0 0 1
//5.   1 0 1 1 0
//
//Введите с какой точки начать обход : 4
//Обход в глубину : 4 2 1 5 3

//1 2 3 4 5
//
//1.   0 1 0 0 1
//2.   1 0 1 1 0
//3.   0 1 0 0 1
//4.   0 1 0 0 1
//5.   1 0 1 1 0
//
//Введите с какой точки начать обход : 1
//Обход в глубину : 1 2 3 5 4
