// Онищенко Фёдор КМБ-1
#include <iostream> //подключием библиотеку
using namespace std; //пространство имен

void main() //основная функция
{
    setlocale(LC_ALL, "RUS"); //локализация
    double X0, Xend, step, e, s, x = 0,n,modul; //инициализируем переменные
    cout << "Введите Х начальное" << endl << "X0 = "; //выводим на экран
    cin >> X0; //вводим значение с клавиатуры
    if (X0 < -1 || X0 > 1) //проверка
    {
        cout << "Введено не допустимое значение";//выводим на экран
        return; //работа программы прекращается
    }
    cout << "Введите X конечное" << endl << "Xend = ";//выводим на экран
    cin >> Xend;//вводим значение с клавиатуры
    if (Xend < X0 || Xend >= 1)//проверка
    {
        cout << "Введено не допустимое значение";//выводим на экран
        return;//работа программы прекращается
    }
    cout << "Введите шаг" << endl << "step = ";//выводим на экран
    cin >> step;//вводим значение с клавиатуры
    cout << "Введите точность" << endl << "e = ";//выводим на экран
    cin >> e;//вводим значение с клавиатуры
    if (!(e > 0))//проверка
    {
        cout << "Введена не допустимая точность";//выводим на экран
        return;//работа программы прекращается
    }
    cout << endl;//выводим на экран
    cout << " \t \t  Ряды Тэйлора" << endl;//выводим на экран
    cout << "-------------------------------------------------" << endl;//выводим на экран
    cout << "|\tX\t|\tF\t|\tn\t|" << endl;//выводим на экран
    cout << "-------------------------------------------------" << endl;//выводим на экран

    for (x = X0; x < Xend; x += step) //основной цикл
    {
        double x1 = 1;//инициализируем переменную
        s = 0; //обнулсяем переменную
        n = 0;//обнулсяем переменную
        modul = sqrt((x / e) * (x / e)); //возводим в модуль
        for (int i = 1; i <= modul; i++) //вложенный цикл
        {
            n += 1;//увеличиваем счетчик элементов
            x1 = pow(x, i);//присваиваем новое значение x
            s += x1 / i; //увеличиваем сумма элементов
        }
        if (n>=1) //условие, при котором мы выводим значения
        {
            cout << "|\t" << x << "\t|" << "\t" << s * (-1) << "\t|" << "\t" << n << "\t|" << endl << "-------------------------------------------------" << endl;//выводим на экран
        }
        else //если условие не выполнено
        {
            cout << "| Невозможно вычислить ряд с заданной точностью |"<< endl << "-------------------------------------------------" << endl;;//выводим на экран
        }
    }
}

//1 Тест
//Введите Х начальное
//X0 = -1
//Введите X конечное
//Xend = 0.9
//Введите шаг
//step = 0.1
//Введите точность
//e = 0.1
//
//Ряды Тэйлора
//------------------------------------------------ -
//| X | F | n |
//------------------------------------------------ -
//| -1 | 0.645635 | 10 |
//------------------------------------------------ -
//| -0.9 | 0.661066 | 9 |
//------------------------------------------------ -
//| -0.8 | 0.5791 | 8 |
//------------------------------------------------ -
//| -0.7 | 0.535079 | 7 |
//------------------------------------------------ -
//| -0.6 | 0.467376 | 6 |
//------------------------------------------------ -
//| -0.5 | 0.407292 | 5 |
//------------------------------------------------ -
//| -0.4 | 0.334933 | 4 |
//------------------------------------------------ -
//| -0.3 | 0.264 | 3 |
//------------------------------------------------ -
//| -0.2 | 0.18 | 2 |
//------------------------------------------------ -
//| -0.1 | 0.1 | 1 |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| 0.2 | -0.2 | 1 |
//------------------------------------------------ -
//| 0.3 | -0.345 | 2 |
//------------------------------------------------ -
//| 0.4 | -0.501333 | 3 |
//------------------------------------------------ -
//| 0.5 | -0.682292 | 4 |
//------------------------------------------------ -
//| 0.6 | -0.899952 | 5 |
//------------------------------------------------ -
//| 0.7 | -1.17258 | 6 |
//------------------------------------------------ -
//| 0.8 | -1.53225 | 7 |
//------------------------------------------------ -
//| 0.9 | -2.04083 | 8 |
//
//
//2 Тест
//Введите Х начальное
//X0 = -1
//Введите X конечное
//Xend = 0.3
//Введите шаг
//step = 0.4
//Введите точность
//e = 0.5
//
//Ряды Тэйлора
//------------------------------------------------ -
//| X | F | n |
//------------------------------------------------ -
//| -1 | 0.5 | 2 |
//------------------------------------------------ -
//| -0.6 | 0.6 | 1 |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//3 Тест
//Введите Х начальное
//X0 = 0
//Введите X конечное
//Xend = 0.8
//Введите шаг
//step = 0.2
//Введите точность
//e = 0.9
//
//Ряды Тэйлора
//------------------------------------------------ -
//| X | F | n |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//4 Тест
//Введите Х начальное
//X0 = -1.1
//Введено не допустимое значение
//
//5 Тест
//Введите Х начальное
//X0 = 0
//Введите X конечное
//Xend = -1
//Введено не допустимое значение
//
//6 тест
//Введите Х начальное
//X0 = 0
//Введите X конечное
//Xend = 0.1
//Введите шаг
//step = 0.1
//Введите точность
//e = -0.1
//Введена не допустимая точность
//
//7 Тест
//Введите Х начальное
//X0 = -0.5
//Введите X конечное
//Xend = 0.9
//Введите шаг
//step = 0.4
//Введите точность
//e = 0.1
//
//Ряды Тэйлора
//------------------------------------------------ -
//| X | F | n |
//------------------------------------------------ -
//| -0.5 | 0.407292 | 5 |
//------------------------------------------------ -
//| Невозможно вычислить ряд с заданной точностью |
//------------------------------------------------ -
//| 0.3 | -0.354 | 3 |
//------------------------------------------------ -
//| 0.7 | -1.18435 | 7 |